# примитивные типы данных

# int() - целое число - 53
# float() - число с плавающей точкой - 53.5
# str() - строка - "53", 'привет'
# bool() - булево значение - True, False


# number = 0
# number_int = int(number)
# number_float = float(number)
# number_str = str(number)
# number_bool = bool(number)


# структуры данных
# list() - список - ['красный', 'синий', 'зеленый']
# tuple() - кортеж - ('красный', 'синий', 'зеленый')
# set() - множество - {'красный', 'синий', 'зеленый', 'красный'}
# dict() - словарь - {'name': 'Артемий', 'age': 10, 'city': 'Сочи', 'is_student': True}


people = ['аРТЕМИЙ', 'еГОР', 'аЛЕКСЕЙ', 'аРТЕМИЙ', 'еГОР', 'аЛЕКСЕЙ', "вася", 'аРТЕМИЙ', 'еГОР', 'аЛЕКСЕЙ']

# people.append('миша')
# people.remove('еГОР')

print(people[6])
# индексы - порядковые номера элементов в списке - 0, 1, 2, 3, 4, 5, 6...

